{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_4": {"name": "input_layer_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "16"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/gap_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/fc_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/fc_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/classifier_head_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/classifier_head_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/forward_lstm_5_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_2_1/backward_lstm_5_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/transpose", "op": "Transpose", "input": ["input_layer_4", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/Shape", "op": "Shape", "input": ["input_layer_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/transpose", "op": "Transpose", "input": ["input_layer_4", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/Shape", "op": "Shape", "input": ["input_layer_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/transpose", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/Shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack_1", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/transpose", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/Shape", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack_1", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/strided_slice", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/ReverseV2", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/strided_slice", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/packed", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/packed", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/packed", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/packed", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/LoopControlInputs/_31", "op": "NoOp", "input": [], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/LoopControlInputs/_75", "op": "NoOp", "input": [], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/Max"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_28", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_29", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_30", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2ZvcndhcmRfbHN0bV80XzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_68", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/Max"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_65", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_69", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_67", "op": "Enter", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_72", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_73", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_74", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_6"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQmFzZWxpbmVfQmlMU1RNX0NsYXNzaWZpZXJfMS9iaWxzdG1fMV8xL2JhY2t3YXJkX2xzdG1fNF8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_24", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_27", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_62"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_22", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_21", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_25", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_26", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_61"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/enter/_23", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_79", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_68", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_103"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_82", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_71", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_106"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_66", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_101"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_76", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_65", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_100"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_80", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_69", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_104"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_81", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_70", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_105"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_78", "op": "Merge", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/enter/_67", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/next_iteration/_102"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/cond/_19/input_control_node/_195", "op": "NoOp", "input": [], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/cond/_63/input_control_node/_229", "op": "NoOp", "input": [], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/cond/_19/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_32", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/merge/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/cond/_19/Baseline_BiLSTM_Classifier_1/bilstm_1_1/forward_lstm_4_1/while/Less/y", "op": "Const", "input": [], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/cond/_63/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_76", "StatefulPartitionedCall/Baseline_BiLSTM_Classifier_1/bilstm_1_1/backward_lstm_4_1/while/merge/_77"], "attr": {"T": 