{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_3": {"name": "input_layer_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "16"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_layernorm_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/key_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/query_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/value_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_core_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_layernorm_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_layernorm_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_layernorm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/mha_block_1/mha_layernorm_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/gap_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/fc_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/fc_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/classifier_head_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/classifier_head_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_concat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/backward_lstm_3_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_2_1/forward_lstm_3_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["input_layer_3", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["input_layer_3", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["input_layer_3", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution/ExpandDims_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution/ExpandDims_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution/ExpandDims_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k3_1/Relu", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k5_1/Relu", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/conv1d_k7_1/Relu", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/mul_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/mul_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/mul_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_concat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k3_1/batchnorm/add_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k5_1/batchnorm/add_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bn_k7_1/batchnorm/add_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_concat_1/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_concat_1/concat", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/cnn_pool_1/MaxPool1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/transpose", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/Shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/transpose", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/Shape", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack_1", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/strided_slice", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/ReverseV2", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/strided_slice", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/backward_lstm_2_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/packed", "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/CNN_BiLSTM_MHA_Classifier_1/bilstm_1_1/forward_lstm_2_1/zeros_1/packed", 